{
	"version": "https://jsonfeed.org/version/1",
	"title": "Christopher Taylor",
	"icon": "https://micro.blog/cjt/avatar.jpg",
	"home_page_url": "https://blog.cjt.io/",
	"feed_url": "https://blog.cjt.io/feed.json",
	"items": [
		
			{
				"id": "http://cjt.micro.blog/2024/03/01/youre-mako-me.html",
				"title": "You're Mako Me Crazy | Mass Effect Legendary Edition |  ★ ★ ★ ★ ★",
				"content_html": "<p>I’m a huge fan of the Mass Effect series. I’ve played through 2 and 3 multiple times - ME2 is definitely on my top 10 games list - and I’m an apologist for <a href=\"https://en.wikipedia.org/wiki/Mass_Effect_3_ending_controversy\">the original ending of 3</a> and for <a href=\"https://screenrant.com/mass-effect-andromeda-bad-worst-me-game-why/\">the entirety of Andromeda</a>. Until last week, I had never played the original Mass Effect. A few thoughts about my experience playing through the game for the first time:</p>\n<ul>\n<li>Prior to this playthrough, I never made it past the first Mako mission. I just couldn’t take it. I think it’s the worst designed vehicle in all of gaming, and honestly, despite improvements in the Legendary Edition (LE) version of the game, I still think that. I finished ME1 <em>in spite</em> of the Mako, and I think <a href=\"https://www.ign.com/articles/why-some-mass-effect-fans-want-to-keep-the-original-mako\">the people who wanted to keep the original version</a> are crazy.</li>\n<li>I deeply respect Bioware’s commitment to going all-in on the RPG elements in ME1. With power/weapon/armor systems in gaming generally, I feel like the usual pattern is to limit the depth of customization before expanding scope in subsequent releases. ME1 starts with serious RPG depth right out of the gate, and I think I actually prefer it to ME2’s more streamlined systems.</li>\n<li>I really enjoyed building my Shepard from scratch and unfolding the <a href=\"https://masseffect.fandom.com/wiki/Storyline#Mass_Effect\">Geth/Reaper/Sovereign story</a> firsthand. I certainly understood the general premise from playing through the sequels, but it was an absolute treat to explore the narrative’s nuances myself, build a main character with “unique” experiences, and have a chance to make different choices than those retroactively made for me when I first played ME2.</li>\n<li>Other than the Mako, if the game has any core weaknesses, they’re mostly relative to ME2 and ME3 (which I mean as a compliment to all three games). In particular, I prefer the way companions and pacing are handled in the sequels.</li>\n</ul>\n<p>In the face of a ballooning backlog, I’m glad I took the time to go through ME1. There’s very little I’d love more than for Bioware to find their magic again; maybe the next Mass Effect game will do just that.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "I’m a huge fan of the Mass Effect series. I’ve played through 2 and 3 multiple times - ME2 is definitely on my top 10 games list - and I’m an apologist for [the original ending of 3](https://en.wikipedia.org/wiki/Mass_Effect_3_ending_controversy) and for [the entirety of Andromeda](https://screenrant.com/mass-effect-andromeda-bad-worst-me-game-why/). Until last week, I had never played the original Mass Effect. A few thoughts about my experience playing through the game for the first time:\n\n- Prior to this playthrough, I never made it past the first Mako mission. I just couldn’t take it. I think it’s the worst designed vehicle in all of gaming, and honestly, despite improvements in the Legendary Edition (LE) version of the game, I still think that. I finished ME1 *in spite* of the Mako, and I think [the people who wanted to keep the original version](https://www.ign.com/articles/why-some-mass-effect-fans-want-to-keep-the-original-mako) are crazy.\n- I deeply respect Bioware’s commitment to going all-in on the RPG elements in ME1. With power/weapon/armor systems in gaming generally, I feel like the usual pattern is to limit the depth of customization before expanding scope in subsequent releases. ME1 starts with serious RPG depth right out of the gate, and I think I actually prefer it to ME2’s more streamlined systems.\n- I really enjoyed building my Shepard from scratch and unfolding the [Geth/Reaper/Sovereign story](https://masseffect.fandom.com/wiki/Storyline#Mass_Effect) firsthand. I certainly understood the general premise from playing through the sequels, but it was an absolute treat to explore the narrative’s nuances myself, build a main character with “unique” experiences, and have a chance to make different choices than those retroactively made for me when I first played ME2.\n- Other than the Mako, if the game has any core weaknesses, they’re mostly relative to ME2 and ME3 (which I mean as a compliment to all three games). In particular, I prefer the way companions and pacing are handled in the sequels.\n\nIn the face of a ballooning backlog, I’m glad I took the time to go through ME1. There’s very little I’d love more than for Bioware to find their magic again; maybe the next Mass Effect game will do just that.\n\n<img src=\"uploads/2024/407a9fbb79.jpg\" width=\"600\" height=\"337\" alt=\"\">\n\n<img src=\"uploads/2024/steamuserimages-a.akamaihd-1.jpg\" width=\"600\" height=\"337\" alt=\"\">\n\n<img src=\"uploads/2024/steamuserimages-a.akamaihd-2.jpg\" width=\"600\" height=\"337\" alt=\"\">\n\n<img src=\"uploads/2024/steamuserimages-a.akamaihd-3.jpg\" width=\"600\" height=\"337\" alt=\"\">\n",
				"date_published": "2024-03-01T11:53:03-08:00",
				"url": "https://blog.cjt.io/2024/03/01/youre-mako-me.html",
				"tags": ["Gaming"]
			},
			{
				"id": "http://cjt.micro.blog/2024/02/19/the-endurance-of.html",
				"title": "The Endurance of Halo",
				"content_html": "<p>Waking up before dawn to play Halo with my childhood best friend is one of my core, formative gaming memories. My mom didn’t allow violent media in the house, so “sneaking out” to the TV early in the morning (and sometimes after bedtime) to play for an hour or two hallmarked our entire playthough of <a href=\"https://www.halopedia.org/Legendary#Halo:_Combat_Evolved_and_Halo:_Anniversary\">Combat Evolved’s Legendary campaign</a>. That same friend and I continued to grow up with Halo, spending thousands of hours playing 2, 3, and multiplayer, but as college neared and our paths diverged, so did Halo as it <a href=\"https://www.gamespot.com/articles/bungie-completes-halo-handover-to-343-on-march-31/1100-6349545/\">moved from Bungie to 343/Microsoft</a>.</p>\n<p>I played <a href=\"https://www.halopedia.org/Halo_4\">Halo 4</a> and <a href=\"https://www.halopedia.org/Halo_5:_Guardians\">Halo 5: Guardians</a>, of course, but it wasn’t the same. It couldn’t be. No Halo game could ever live up to the nostalgia of the early days for me, and that’s okay! Regardless of its legacy <em>for me</em>, the franchise also started to lose some of its identity with those releases, and I think many fans had been waiting for a Halo renaissance.</p>\n<p>More than 20 years since those original Combat Evolved memories, I just finished <a href=\"https://www.halopedia.org/Halo_Infinite\">Halo Infinite</a> and find myself, clearly, on a nostalgia trip. I really enjoyed Infinite - far more than 4 or 5 - and just wanted to share a few thoughts about my time with the game:</p>\n<ul>\n<li>I think the <a href=\"https://www.halopedia.org/Grappleshot\">grappling hook</a>, especially post-upgrades, might be my favorite in any game.</li>\n<li>The world is simply beautiful, and it especially shines after unlocking <a href=\"https://www.halopedia.org/AV-49_Wasp\">the Wasp</a> when you can fully/easily explore the game’s verticality. From an environment and traversal perspective, it’s up there with my favorite open worlds ever.</li>\n<li>Speaking of open worlds, this is the first open world Halo game, and I think 343 got a lot right. Some of the progression feels a bit superfluous, but I’m a sucker for a big map with a lot of icons to conquer, and this totally scratched that itch while still serving an overarching narrative.</li>\n<li>The story was fine, but it still feels like the franchise is contending with narrative decisions it really wishes it hadn’t made in Halo 4. It was nice to get a bit of closure for a certain core character, but the story is still far from the more grounded roots established in CE, 2, and 3. With a strong open world formula established, I’m really hoping more focus can be placed on the story in future games.</li>\n<li>Infinite’s multiplayer is the first I’ve felt compelled to play since Reach; it’s really good.</li>\n</ul>\n<p>Despite <a href=\"https://www.washingtonpost.com/video-games/2022/03/30/halo-infinite-live-service-new-content-forge/\">lingering live service-related issues</a>, my playthrough of Infinite gave me a ton of hope for the future of the franchise. I think 343 is finally getting into a groove, and I hope Microsoft lets them keep cooking.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Waking up before dawn to play Halo with my childhood best friend is one of my core, formative gaming memories. My mom didn’t allow violent media in the house, so “sneaking out” to the TV early in the morning (and sometimes after bedtime) to play for an hour or two hallmarked our entire playthough of [Combat Evolved’s Legendary campaign](https://www.halopedia.org/Legendary#Halo:_Combat_Evolved_and_Halo:_Anniversary). That same friend and I continued to grow up with Halo, spending thousands of hours playing 2, 3, and multiplayer, but as college neared and our paths diverged, so did Halo as it [moved from Bungie to 343/Microsoft](https://www.gamespot.com/articles/bungie-completes-halo-handover-to-343-on-march-31/1100-6349545/). \r\n\r\nI played [Halo 4](https://www.halopedia.org/Halo_4) and [Halo 5: Guardians](https://www.halopedia.org/Halo_5:_Guardians), of course, but it wasn’t the same. It couldn’t be. No Halo game could ever live up to the nostalgia of the early days for me, and that’s okay! Regardless of its legacy *for me*, the franchise also started to lose some of its identity with those releases, and I think many fans had been waiting for a Halo renaissance.\r\n\r\nMore than 20 years since those original Combat Evolved memories, I just finished [Halo Infinite](https://www.halopedia.org/Halo_Infinite) and find myself, clearly, on a nostalgia trip. I really enjoyed Infinite - far more than 4 or 5 - and just wanted to share a few thoughts about my time with the game:\r\n\r\n- I think the [grappling hook](https://www.halopedia.org/Grappleshot), especially post-upgrades, might be my favorite in any game.\r\n- The world is simply beautiful, and it especially shines after unlocking [the Wasp](https://www.halopedia.org/AV-49_Wasp) when you can fully/easily explore the game’s verticality. From an environment and traversal perspective, it’s up there with my favorite open worlds ever.\r\n- Speaking of open worlds, this is the first open world Halo game, and I think 343 got a lot right. Some of the progression feels a bit superfluous, but I’m a sucker for a big map with a lot of icons to conquer, and this totally scratched that itch while still serving an overarching narrative.\r\n- The story was fine, but it still feels like the franchise is contending with narrative decisions it really wishes it hadn’t made in Halo 4. It was nice to get a bit of closure for a certain core character, but the story is still far from the more grounded roots established in CE, 2, and 3. With a strong open world formula established, I’m really hoping more focus can be placed on the story in future games.\r\n- Infinite’s multiplayer is the first I’ve felt compelled to play since Reach; it’s really good.\r\n\r\nDespite [lingering live service-related issues](https://www.washingtonpost.com/video-games/2022/03/30/halo-infinite-live-service-new-content-forge/), my playthrough of Infinite gave me a ton of hope for the future of the franchise. I think 343 is finally getting into a groove, and I hope Microsoft lets them keep cooking.\n\n<img src=\"uploads/2024/1240440-screenshots-20240218172953-1.jpg\" width=\"600\" height=\"251\" alt=\"\"><img src=\"uploads/2024/1240440-screenshots-20240218141256-1.jpg\" width=\"600\" height=\"251\" alt=\"\">\n",
				"date_published": "2024-02-19T21:44:44-08:00",
				"url": "https://blog.cjt.io/2024/02/19/the-endurance-of.html",
				"tags": ["Gaming"]
			},
			{
				"id": "http://cjt.micro.blog/2024/02/19/starting-fresh.html",
				"title": "Starting Fresh",
				"content_html": "<p>Spinning up a <a href=\"https://blog.cjt.io/\">micro blog</a> as an outlet for random thoughts. Most content will be gaming-related, but I’m sure errant tech musings and other generic notions will find purchase here from time to time. No idea how long I’ll stick with it, but at least I’ll have a space to <a href=\"https://blog.cjt.io/2024/02/19/the-endurance-of.html\">discuss grappling hooks</a> if the need arises.</p>\n",
				"content_text": "Spinning up a [micro blog](https://blog.cjt.io/) as an outlet for random thoughts. Most content will be gaming-related, but I’m sure errant tech musings and other generic notions will find purchase here from time to time. No idea how long I’ll stick with it, but at least I’ll have a space to [discuss grappling hooks](https://blog.cjt.io/2024/02/19/the-endurance-of.html) if the need arises.\n",
				"date_published": "2024-02-19T20:25:07-08:00",
				"url": "https://blog.cjt.io/2024/02/19/starting-fresh.html"
			}
	]
}
